In [1]:
! pip install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from pandas) (1.24.2)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

pandas ==> it is a open source library that is used for data manipulation.
1.series
2.dataframe

In [2]:
import pandas as pd

# Series

In [5]:
a=pd.Series([1,3,53,5])
a

0     1
1     3
2    53
3     5
dtype: int64

In [6]:
type(a)

pandas.core.series.Series

# Dataframe

In [11]:
a={
    "emp_id":[1,2,3,4,5,6,7,8],
    "name":["sam","raj","ankit","nidhi","sam","pallavi","garvit","sam"],
    "department":["it","sales","it","it","sales","it","operations","sales"],
    "working_hours":[8,9,9,9,8,9,8,8]
}

In [12]:
type(a)

dict

In [14]:
df=pd.DataFrame(a)
df

   emp_id     name  department  working_hours
0       1      sam          it              8
1       2      raj       sales              9
2       3    ankit          it              9
3       4    nidhi          it              9
4       5      sam       sales              8
5       6  pallavi          it              9
6       7   garvit  operations              8
7       8      sam       sales              8

# how can we import or export our dataframe

In [19]:
df.to_csv("/Users/gauravjangid/Desktop/data analysis/employee_csv",index=False)

In [21]:
pd.read_csv("/Users/gauravjangid/Desktop/data analysis/employee_csv")

   emp_id     name  department  working_hours
0       1      sam          it              8
1       2      raj       sales              9
2       3    ankit          it              9
3       4    nidhi          it              9
4       5      sam       sales              8
5       6  pallavi          it              9
6       7   garvit  operations              8
7       8      sam       sales              8

# how can we check top 5 data ?

In [22]:
df.head()

   emp_id   name department  working_hours
0       1    sam         it              8
1       2    raj      sales              9
2       3  ankit         it              9
3       4  nidhi         it              9
4       5    sam      sales              8

In [23]:
df.head(2)

   emp_id name department  working_hours
0       1  sam         it              8
1       2  raj      sales              9

# how can we check last 5 data ?

In [25]:
df.tail()

   emp_id     name  department  working_hours
3       4    nidhi          it              9
4       5      sam       sales              8
5       6  pallavi          it              9
6       7   garvit  operations              8
7       8      sam       sales              8

In [26]:
df.tail(2)

   emp_id    name  department  working_hours
6       7  garvit  operations              8
7       8     sam       sales              8

#

# how can we check random indexed data

In [27]:
df.sample(3)

   emp_id     name  department  working_hours
6       7   garvit  operations              8
0       1      sam          it              8
5       6  pallavi          it              9

# how can we check total shaoe of data

In [29]:
df.shape

(8, 4)

# how can we check total columns in dataframe

In [30]:
df.columns

Index(['emp_id', 'name', 'department', 'working_hours'], dtype='object')

# Case-1

    you have to update aniket to yamini and raj to rajat

In [31]:
df['name']

0        sam
1        raj
2      ankit
3      nidhi
4        sam
5    pallavi
6     garvit
7        sam
Name: name, dtype: object

In [33]:
df['name'][1]='rajat'
df['name'][3]='yamini'

/var/folders/t4/5wqc_6jd0h95lx69zyrs_3jh0000gn/T/ipykernel_13157/2007378678.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'][1]='rajat'
/var/folders/t4/5wqc_6jd0h95lx69zyrs_3jh0000gn/T/ipykernel_13157/2007378678.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'][3]='yamini'

In [34]:
df

   emp_id     name  department  working_hours
0       1      sam          it              8
1       2    rajat       sales              9
2       3    ankit          it              9
3       4   yamini          it              9
4       5      sam       sales              8
5       6  pallavi          it              9
6       7   garvit  operations              8
7       8      sam       sales              8

In [36]:
df['working_hours'][1]=10
df

/var/folders/t4/5wqc_6jd0h95lx69zyrs_3jh0000gn/T/ipykernel_13157/59467670.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['working_hours'][1]=10

   emp_id     name  department  working_hours
0       1      sam          it              8
1       2    rajat       sales             10
2       3    ankit          it              9
3       4   yamini          it              9
4       5      sam       sales              8
5       6  pallavi          it              9
6       7   garvit  operations              8
7       8      sam       sales              8

# how can we check total sub cateories frequency of a column

In [38]:
df['name'].value_counts()

sam        3
rajat      1
ankit      1
yamini     1
pallavi    1
garvit     1
Name: name, dtype: int64

In [39]:
df['department'].value_counts()

it            4
sales         3
operations    1
Name: department, dtype: int64

In [41]:
# how can we handle missing data

In [42]:
df.isnull().sum()

emp_id           0
name             0
department       0
working_hours    0
dtype: int64

In [43]:
df

   emp_id     name  department  working_hours
0       1      sam          it              8
1       2    rajat       sales             10
2       3    ankit          it              9
3       4   yamini          it              9
4       5      sam       sales              8
5       6  pallavi          it              9
6       7   garvit  operations              8
7       8      sam       sales              8

In [45]:
df["department"][3]=None
df["name"][1]=None

/var/folders/t4/5wqc_6jd0h95lx69zyrs_3jh0000gn/T/ipykernel_13157/4237654003.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["department"][3]=None
/var/folders/t4/5wqc_6jd0h95lx69zyrs_3jh0000gn/T/ipykernel_13157/4237654003.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["name"][1]=None

In [46]:
df.isnull().sum()

emp_id           0
name             1
department       1
working_hours    0
dtype: int64

In [48]:
df=df.dropna()

In [51]:
df.isnull().sum()

emp_id           0
name             0
department       0
working_hours    0
dtype: int64

In [52]:
df

   emp_id     name  department  working_hours
0       1      sam          it              8
2       3    ankit          it              9
4       5      sam       sales              8
5       6  pallavi          it              9
6       7   garvit  operations              8
7       8      sam       sales              8

# TASK-1 
    student info ==>st_id,course_name,course_duration,fees
    
    opr ==> import,export,head(),tail(),sample(),create missing data,handle missing data,value_count